#pragma once
#include "../devSettings.h"
#include "../devTime.h"
//---------------------------------------------------------------------------------------








 /* //==================================================================================*
* //                                                                                    *
* // Сервоприводы, и их работа															*
* //													                                *
* //------------------------------------------------------------------------------------*
*///
class
	AServo
{
	public:
		AServo ();


		void initialization();				//Инциализациия сервоприводов
		void update(const ATime &time);		//системное обновелине сервоприводов
	

	
	private:
	
		INT8 m_positionA;//позиция сервы А
		INT8 m_positionB;//позиция сервы Б
		int tt;
		
	
};

