#pragma once
#include "../resource.h"
#include "prtStream.h"
//---------------------------------------------------------------------------------------







/* //===================================================================================*
* //                                                                                    *
* // Баовый интерфес обработки сырых данных которые образуют команду					*
* //------------------------------------------------------------------------------------*
*///
class
	AProxyCommand
{
	public:
		AProxyCommand ();


	
		bool isCorrect(const BYTE data) const;//проверка, являятся ли данные корректны для терминала
		void execute(const BYTE data, AStream *stream);//Обработка и выделение командной строки
		

		void slaveMotorStop();
	
	private:
		int k;
	
	
};
