#pragma once
#include "../devSettings.h"
//---------------------------------------------------------------------------------------




//---------------------------------------------------------------------------------------
#define MAX_CIRCULAR_BUFFER		0x20	//максимальный кольцевой буфер для протокола
//---------------------------------------------------------------------------------------







/* //===================================================================================*
* //                                                                                    *
* // Реализация кольцевого буфера														*
* //------------------------------------------------------------------------------------*
*///
class
	AFIFO
{
	public:
		AFIFO();


		bool push_back(const BYTE data);//Запихнем данные в конец очереди
		BYTE pop_front();//Вытащим данные из начала очереди

		void clear();//очистить очередь	
		int count()const; //количество элементов в буфере
		bool isFree()const;//
	private:
	
		BYTE	m_buffer[MAX_CIRCULAR_BUFFER];
		int		m_indexBegin;//указатель на начало очереди
		int		m_indexEnd;//указатель на конец очереди
		int		m_count;//количество элементов

};
