#pragma once
#include "devSettings.h"
//---------------------------------------------------------------------------------------



/* временные задержки для прерывания
 * делитель 64
 * OCR = (F_CPU / 64) * 0.001сек
*/
#define TIME_OCR_TICK	3125		//0.010сек
#define TIME_OCR_SERVO	16			//0.00005сек





/* //===================================================================================*
* //                                                                                    *
* // Система времени 1 тик равен 10мсек													*
* //------------------------------------------------------------------------------------*
*///
class
	ATime
{
	public:
		ATime ();


		void initialization(); //инциализация времени
		void update();//обновление нового тика для времени

		DWORD	getTime() const;//возвратим текущее время в тиках
		DWORD	getTimeMS()const;//возвратим текущнн время в милискундах
		WORD	elapsed() const;//время прошедшее с последнего обновления
	
		static int fromMS(const int ms);//возвратим значение времени в милисекундах
	private:
	
		DWORD	m_dwLastTick;
		WORD	m_elapsed;	


};
